%记录锁的数量和每种槽高出现的次数
cnt=0;
a=[0,0,0,0,0,0];
%遍历所有可能的槽高排列
for i=1:1:6
    %第1个槽的高度为i,高度为i的槽高出现次数+1
    a(i)=a(i)+1;
    for j=1:1:6
        %第2个槽的高度为j,高度为j的槽高出现次数+1
        a(j)=a(j)+1;
        for k=1:1:6
            %第3个槽的高度为k,高度为k的槽高出现次数+1
            a(k)=a(k)+1;
            for l=1:1:6
                %第4个槽的高度为l,高度为l的槽高出现次数+1
                a(l)=a(l)+1;
                for t=1:1:6
                    %第5个槽的高度为t,高度为t的槽高出现次数+1
                    a(t)=a(t)+1;
                    %假设当前槽高排列符合要求
                    flag=1;
                    %初始化出现的槽高种类数为0
                    sum=0;
                    %求出出现槽高的种类数
                    for x=1:1:6
                        if(a(x)>0)
                            sum=sum+1;
                        end
                    end
                    %如果槽高种类数小于3，或相邻槽高高度差等于5,则假设不成立
                    if abs(i-j)==5||abs(j-k)==5||abs(k-l)==5||abs(l-t)==5||sum<3
                        flag=0;
                    end
                    %如果假设成立，锁的种类数+1
                    if(flag==1)
                        cnt=cnt+1;
                    end
                    %高度为t的槽高出现次数-1
                    a(t)=a(t)-1;
                end
                %高度为l的槽高出现次数-1
                a(l)=a(l)-1;
            end
            %高度为k的槽高出现次数-1
            a(k)=a(k)-1;
        end
        %高度为j的槽高出现次数-1
        a(j)=a(j)-1;
    end
    %高度为i的槽高出现次数-1
    a(i)=a(i)-1;
end
cnt